{
  "responseHeader":{
    "status":0,
    "QTime":30},
  "match":{"numFound":1,"start":0,"docs":[
      {
        "date":["2023-11-26T00:00:00Z"],
        "title":["Media Outlet Criticized for Trying to Normalize 'the Death of Trump'"],
        "source_url":["theepochtimes.com"],
        "source_name":["www.theepochtimes.com"],
        "url":["https://www.theepochtimes.com/us/media-outlet-criticized-for-trying-to-normalize-the-death-of-trump-5536065"],
        "body":["A mainstream media outlet was criticized over its decision to publish the article.\n\nMedia outlet Business Insider was criticized over the weekend after publishing an article that offered speculation regarding what would happen \"if Donald Trump dies while running in the 2024 election.\"\n\nIn an article published Saturday, the outlet, also known as Insider, listed several different scenarios that would occur if the former president passed away before the GOP primary, during the primary, or between the primary and the general election. Former President Trump, 77, is by far the leading GOP presidential candidate, besting the No. 2 and No. 3 candidates by more than 45 percentage points, respectively.\n\n\"If Trump died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries,\" the article said, in part. \"If Trump died after the last primary contest but before the Republican National Convention, the other GOP presidential candidates would have to make a case to every state delegation at the convention for why they should be the party's nominee,\" it also said.\n\nInsider also recently ran an article with the title, \"What happens if a sitting president dies while running for reelection,\" including a photo of President Joe Biden. However, unlike the Trump article, Insider did not specifically make reference to President Biden in the headline. And unlike the Trump article, Insider used President Biden's last name sparingly throughout the article, although it did mention that President Biden turned 81 several days ago.\n\n\"If the president died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries,\" the article stated.\n\nAfter Insider published the speculative article regarding President Trump's death during the primary, some conservative commentators offered criticism. Some also claimed it's part of an attempt to normalize President Trump's death, suggesting a nefarious plot could be carried out.\n\nIn 2017, Rep. Scalise (R-La.) was shot during a practice session for the Congressional Baseball Game in Virginia. A 66-year-old self-described Bernie Sanders supporter, James Hodgkinson, was identified as the shooting suspect before he was killed by officers in a shootout.\n\nThe Epoch Times has contacted Insider for comment Sunday. The outlet has not publicly responded to the criticism of the Trump article on social media or elsewhere. President Trump also has not made any comments about it.\n\nA Monmouth University poll published last month found 76 percent of voters believe the president is too old, compared to 48 percent who said the same thing about President Trump.\n\nIn another poll from The Associated Press-NORC published in August, some 77 percent said President Biden is too old to serve another four years in office. In contrast, around half of American adults said the same about President Trump."],
        "image_url":["https://img.theepochtimes.com/assets/uploads/2023/11/06/id5523910-GettyImages-1771855590-1080x720.jpg"],
        "id":"559aff35-d8f3-43e4-99a3-243eec287d8a",
        "_version_":1785595714814869505}]
  },
  "response":{"numFound":9628,"start":0,"docs":[
      {
        "date":["2023-11-25T00:00:00Z"],
        "title":["Here's what happens if Donald Trump dies while running in the 2024 presidential election"],
        "source_url":["businessinsider.com"],
        "source_name":["Business Insider"],
        "url":["https://www.businessinsider.com/if-donald-trump-dies-presidential-election-republican-candidates-2023-11"],
        "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nFormer President Donald Trump is far and away the Republican frontrunner heading into the 2024 election.\n\nHe is 77 years old and will be 78 in June.\n\nIf Trump dies while seeking reelection, a few different things could happen, depending on when he dies and how close it is to Election Day.\n\nThere's no national deadline to file to run for president of the United States. Instead, filing deadlines vary depending on the state and party.\n\nThere are currently eight declared candidates, including Trump, on the GOP side. If Trump were to die before January 1, 2024, there would likely be other Republicans who want to jump into the race.\n\nMany states' filing deadlines have already passed, however, meaning that state election officials would need to adjust them to allow new candidates to enter the race.\n\nIf Trump died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries.\n\nThere's some precedent for this; at the height of the COVID-19 pandemic, more than a dozen states postponed their primaries or expanded vote-by-mail options.\n\nIf Trump died after the last primary contest but before the Republican National Convention, the other GOP presidential candidates would have to make a case to every state delegation at the convention for why they should be the party's nominee.\n\nAnd if Trump secured the GOP nomination but died between the convention and Election Day 2024, the RNC would convene to select another presidential candidate."],
        "image_url":["https://i.insider.com/655b80314ca513d8242c330a?width=1200&format=jpeg"],
        "id":"6016ef59-66fc-4051-b0d6-5bdf72f83121",
        "_version_":1785595716076306432},
      {
        "date":["2023-11-24T00:00:00Z"],
        "title":["What happens if a sitting president dies while running for reelection"],
        "source_url":["businessinsider.com"],
        "source_name":["Business Insider"],
        "url":["https://www.businessinsider.com/what-happens-if-president-dies-while-running-reelection"],
        "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nUS President Joe Biden turned 81 years old on Monday.\n\nIt's a milestone for Biden, but his age has been a thorny issue for the president, with recent polling showing voters are concerned about his age ahead of a tough reelection campaign next year.\n\nAnd it raises another obvious question: what happens if a sitting president dies while running for reelection?\n\nWell, in the immediate aftermath, we would get President Kamala Harris -- who would be the first female president and just its second Black president.\n\nThe US has a clear presidential order of succession outlined in the Constitution and the Presidential Succession Act of 1947, saying that if the president dies, the vice president takes over.\n\nFrom an electoral standpoint, Harris would also replace Biden as a Democratic presidential candidate. But his death would almost certainly open the door for other Democrats to jump into the 2024 race.\n\nThere's no national deadline to file to run for president of the United States. Instead, filing deadlines vary depending on the state and party.\n\nMany states' deadlines have already passed, however, meaning that state election officials would need to adjust them to allow new candidates to enter the race.\n\nIf the president died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries.\n\nThere's some precedent for this; at the height of the COVID-19 pandemic, more than a dozen states postponed their primaries or expanded vote-by-mail options.\n\nAnd if a sitting president died after the primaries but before their party's convention, the other presidential candidates would have to make a case to every state delegation at the convention for why they should be the party's nominee.\n\nFinally, if a president died after securing their party's nomination but before Election Day, both the Democratic and Republican parties have guidelines in place for selecting an alternate."],
        "image_url":["https://i.insider.com/655cd8744ca513d8242cd87e?width=1200&format=jpeg"],
        "id":"790aa910-41bb-4fad-beff-e1078ffd08c7",
        "_version_":1785595732599767040},
      {
        "date":["2023-11-27T00:00:00Z"],
        "title":["Russia put a Meta employee on a wanted list after designating the company a 'terrorist and extremist' organization"],
        "source_url":["businessinsider.com"],
        "source_name":["Business Insider"],
        "url":["https://www.businessinsider.com/russia-facebook-instagram-meta-employee-spokesperson-wanted-ukraine-2023-11"],
        "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nA Meta spokesperson has been wanted by Russia's Ministry of Internal Affairs database since February, media outlets based in Russia found on Sunday.\n\nAccording to Mediazona, a Russian outlet not affiliated with the state, Andy Stone is wanted by the ministry for unspecified terrorism charges. Russian state news agency TASS also reported that Stone is \"wanted under an article of the Russian Criminal Code.\"\n\nStone serves as the communications director for Meta and has been working at the social media company since 2014, per LinkedIn.\n\nThe outlet also reported that Stone was arrested in absentia by a Russian court in mid-November. Details of his case have not been released, per the outlet. The wanted database also does not give any details about his case.\n\nThe charges against Stone are another layer in Russia's crackdown on the social media giant. Before the war in Ukraine, Meta products like Facebook and Instagram enjoyed popularity among Russian users. However, the sites are now banned in Russia, and Meta itself has been listed as a \"terrorist\" and \"extremist\" organization since October 2022.\n\nWhatsApp, also owned by Meta, is still operating in the country, Mediazona reported.\n\nRussia also opened a case against Meta in March 2022, saying that the company promoted \"terrorist activity\" after it altered its hate speech rules for Ukrainian and Polish users.\n\nMediazona reported that, at the time, the Russian ministry mentioned Stone in a press release because he had announced Meta's decision to allow users to post about the \"death of Russian invaders.\"\n\nAt the time, Stone announced that the calls would be treated as political speech rather than actual threats.\n\nMeta did not immediately respond to a request for comment from Business Insider."],
        "image_url":["https://i.insider.com/6563e5d0fd6200867dcf5f8f?width=1200&format=jpeg"],
        "id":"9ddfc22c-7b8b-4992-b8b0-9c6be0313775",
        "_version_":1785595766608232448},
      {
        "date":["2023-12-06T00:00:00Z"],
        "title":["Sen. John Fetterman's viral troll of expelled Rep. George Santos cost $343.20"],
        "source_url":["news.yahoo.com"],
        "source_name":["Yahoo News"],
        "url":["https://news.yahoo.com/sen-john-fettermans-viral-troll-183257959.html"],
        "body":["\"I thought my ethically-challenged colleague @BobMenendezNJ could use some encouragement given his substantial legal problems. So, I approached a seasoned expert on the matter to give 'Bobby from Jersey' some advice,\" the Pennsylvania senator wrote on X.\n\nAn attached Cameo video shows the former New York representative, who was expelled after a 311-114 vote in Congress on Friday, giving Menendez advice on how to \"stay strong\".\n\n\"You stand your ground, sir,\" Santos said in the video. \"And don't get bogged down by all the haters out there.\"\n\nGeorge Santos is now on Cameo: How much is the former congressman making?\n\nSantos became a Cameo creator just days after he was ousted. The former congressman's profile on the video message platform reads: \"Former congressional 'Icon'!,\" and \"The Expelled member of Congress from New York City.\"\n\nHe initially charged $75 for personalized video, which then increased to $200. A spokesperson for Fetterman told Business Insider that the Senator paid a total of $343.20 in total. The fee included an extra charge for delivering the video within 24 hours.\n\nSantos delivered Fetterman's video in 16 minutes following the request, a spokesperson told Business Insider.\n\nSantos was expelled after a report from the House Ethics Committee found substantial evidence that he misused campaign funds for his personal benefit and committed federal crimes.\n\nMenendez is also surrounded by accusations of ethics violations. Federal prosecutors accused him of taking bribes in exchange for illegally helping the Egyptian government.\n\nBob Menendez: Gold Bars found in Sen. Menendez's New Jersey home linked to 2013 robbery, NBC reports\n\nThis article originally appeared on USA TODAY: Sen. Fetterman, George Santos Cameo video: Senator paid over $300"],
        "image_url":["https://s.yimg.com/ny/api/res/1.2/L4z9jkR5Mw5uH.bJED9ClQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NDc7Y2Y9d2VicA--/https://media.zenfs.com/en/usa_today_news_641/eda911030868cce5a64b7bba55d69b5b"],
        "id":"e0bd6233-afa2-4b37-8cf4-87021b255909",
        "_version_":1785595738337574913},
      {
        "date":["2023-12-01T00:00:00Z"],
        "title":["'Pretty horrific mistakes:' Democrats have few nice things to say about Henry Kissinger following his death"],
        "source_url":["news.yahoo.com"],
        "source_name":["Yahoo News"],
        "url":["https://news.yahoo.com/pretty-horrific-mistakes-democrats-few-232623172.html"],
        "image_url":["https://s.yimg.com/ny/api/res/1.2/LbcyTOE6u9F7a6y8JT5JsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/business_insider_articles_888/c94a2a8fd70b1002072a8586147c893e"],
        "id":"efc29863-09ec-4f4b-a6ff-927ede80c2e2",
        "body":["\"Let him rest in peace. I've had my statements,\" Sanders told Business Insider.\n\nTypically, when a former leading statesman dies, members of Congress only offer glowing tributes.\n\nNot in the case of Henry Kissinger.\n\n\"There's not much about Kissinger that I've heard that I think is particularly good,\" Democratic Rep. Greg Casar of Texas told Business Insider on Thursday.\n\nThe former Secretary of State's death at the age of 100 has spurred yet another round of reflections on Kissinger's legacy, which is largely intertwined with the height of America's Cold War foreign policy.\n\nKissinger, who served as both the National Security Advisor and Secretary of State under Republican Presidents Richard Nixon and Gerald Ford, has been lauded for his effectiveness in opening up relations between the US and China and pursuing a policy of detente with the Soviet Union.\n\nBut he also had a hand in foreign policy decisions that hurt and killed millions of people, including supporting repressive right-wing regimes in Latin America and planning indiscriminate bombing campaigns in Southeast Asia. Some have even argued that Kissinger should have been prosecuted for perpetrating war crimes.\n\n\"I think it's an incredibly complicated legacy,\" said Sen. Chris Murphy of Connecticut, summing up what may be the mainstream Democratic viewpoint. \"There are some pretty horrific mistakes that Henry Kissinger made that have taken the United States a very long time to recover from.\"\n\nMurphy added that Kissinger \"cared deeply about the nation's security,\" had \"significant foreign policy victories,\" and is \"a big man with a big legacy.\"\n\nCasar, who traveled to Brazil, Chile and Colombia with other progressives lawmakers in August, said they've been \"working really hard to undo\" the harms of Kissinger's policies in Latin America, which included supporting a coup by General Augusto Pinochet in 1973.\n\n\"If you ask people in Chile, there are still lots of people who are looking for the bodies of their family members that were taken and disappeared by the Pinochet regime that the United States supported,\" said Casar.\n\nOther Democrats have issued similar critiques of Kissinger's legacy in the wake of his death.\n\n\"I never understood why people revered him,\" Rep. Jim McGovern of Massachusetts wrote on X. \"I will never forgive or forget.\"\n\nRep. Gerry Connolly of Virginia, a senior Democrat on the House Foreign Affairs committee, wrote on X that Kissinger's \"indifference to human suffering will forever tarnish his name and shape his legacy.\"\n\nKissinger has also become an issue in recent Democratic presidential campaigns.\n\nIn 2016, Sen. Bernie Sanders of Vermont famously criticized Hillary Clinton for seeking foreign policy advice from the controversial former secretary of state.\n\n\"I happen to believe that Henry Kissinger was one of the most destructive secretaries of state in the modern history of this country,\" Sanders said at a February 2016 debate. \"I am proud to say that Henry Kissinger is not my friend. I will not take advice from Henry Kissinger.\"\n\nAt the time, Sanders specifically cited Kissinger's masterminding of a carpet bombing campaign in Cambodia during the Vietnam War, which paved the way for the rise of the Khmer Rouge and the mass killing of more than 3 million people.\n\n\"Count me in as somebody who will not be listening to Henry Kissinger,\" Sanders added at that debate.\n\nSanders later re-upped that criticism during his 2020 presidential campaign, when he criticized then-Secretary of State Mike Pompeo for meeting with Kissinger.\n\nOn Thursday, Sanders told Business Insider that he had no reflections to offer on Kissinger's death.\n\n\"Nope. I don't,\" said Sanders. \"He died. Let him rest in peace. I've had my statements.\"\n\nDespite criticism from Democrats, plenty of Republicans have offered warm tributes to Kissinger, including former President George W. Bush and Senate Minority Leader Mitch McConnell.\n\n\"Today, the world Henry Kissinger leaves behind bears his indelible mark,\" McConnell said on the Senate floor on Thursday. \"The nation he served -- the global superpower he helped create -- owes him our gratitude.\""],
        "_version_":1785595710344790018},
      {
        "date":["2023-12-01T00:00:00Z"],
        "title":["Why on Earth did Ron DeSantis think it was a good idea to debate Gavin Newsom?"],
        "source_url":["businessinsider.com"],
        "source_name":["Business Insider"],
        "url":["https://www.businessinsider.com/why-on-earth-did-ron-desantis-debate-gavin-newsom-2023-12"],
        "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nThere's nothing people love more than watching a likely catastrophe live.\n\nCase in point: around 40,000 Texans lined up to watch two trains crash into each other in 1896 for a marketing ploy by the Missouri-Kansas-Texas Railroad that ended in death and disaster.\n\nSimilarly, on Thursday night, millions tuned into or watched highlights of an unnecessary debate between Republican presidential candidate and Florida Gov. Ron DeSantis and California Gov. Gavin Newsom.\n\nNo humans died on Thursday -- unlike the \"Crash at Crush\" -- but the night was still a trainwreck for DeSantis' presidential campaign from the very beginning.\n\n\"There's one thing, in closing, that we have in common,\" Newsom noted in his opening statement, \"is neither of us will be the nominee for our party in 2024.\"\n\nRealistically, DeSantis had the upper hand from the start: the debate was held in Georgia (much closer to his home state than California), hosted by conservative news outlet Fox News, and moderated by one of its most tenured right-wing presenters, Sean Hannity.\n\nDebates, truthfully, can be tricky to pick a \"winner\" for. Following the first GOP presidential debate this year, Business Insider and several other outlets called Vivek Ramaswamy a breakout star after commanding attention away from his competitors.\n\nBut after the dust had settled, polling showed that Ramaswamy's performance -- despite being attention-grabbing and Trump-like -- may have actually hurt how potential voters viewed him.\n\nUnlike the Republican presidential debates, there likely weren't any pre-and-post-debate polls from the Newsom-DeSantis clash. And while each base will surely view the debates from differing perspectives, it's hard to imagine many potential voters were won over by DeSantis explicitly saying it's \"not true\" that he's followed \"science\" and \"facts\" during his time in office.\n\nAll Newsom seemed to do at the debate was highlight DeSantis' actions and policies during his time in congressional and state leadership, but it was more than enough to send the Florida governor into a series of grimaces and uncomfortably forced smiles.\n\nSo why on Earth would DeSantis agree to a debate like this in the first place?\n\nThe likeliest reason is that despite being in second place in the GOP presidential primary polling, DeSantis is nearly 50 percentage points behind former President Donald Trump.\n\nBarring Trump going to prison before the 2024 election, which could happen given the 91 felony charges levied against him in jurisdictions across the country, it's pretty much an insurmountable hurdle to overcome.\n\nWith this in mind, DeSantis and his campaign likely saw the debate similar to how an NFL team views a \"hail mary\" pass at the end of a close game: highly improbable it'll work out for the best, but if it does, everyone involved comes out as a hero.\n\nUnfortunately for DeSantis, the legacy of Thursday night's debate likely won't be about how the Florida governor turned his flopping campaign around against all odds.\n\nInstead, cringeworthy images, GIFs, and videos from the evening may come back to haunt him for the rest of this presidential campaign and possibly even in 2028 if he decides to run again too, especially if Newsom runs as well."],
        "image_url":["https://i.insider.com/6569faa758e7c0c29a28b057?width=1200&format=jpeg"],
        "id":"a876d91b-3cc8-44c8-8ef5-94cc538b13df",
        "_version_":1785595750075334657},
      {
        "date":["2023-11-17T00:00:00Z"],
        "title":["Exploding drones are proving a weapon unlike any other in Ukraine, and no one is safe, combat videos show"],
        "source_url":["businessinsider.com"],
        "source_name":["Business Insider"],
        "url":["https://www.businessinsider.com/videos-nothing-is-safe-from-exploding-drones-in-ukraine-2023-11"],
        "image_url":["https://i.insider.com/6556516136d588dc55d1a7b4?width=1200&format=jpeg"],
        "id":"b214cf57-665b-4ff7-b78f-7baff2ca05d9",
        "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nMore and more, it isn't just tanks and armored vehicles falling prey to cheap hobby drones packed with explosives in Ukraine. These weapons are seemingly everywhere, killing not just unlucky vehicle crews but also dismounted infantry, sometimes even just a single soldier. Anything that moves is at risk.\n\n\"Welcome to the future. It sucks,\" a drone expert told Insider as combat footage from Ukraine on social media increasingly shows that nothing and no one is safe from these weapons.\n\nWhile videos from the war still regularly show first-person-view (FPV) drones slamming into tanks, armored personnel carriers, and supply trucks, footage also frequently shows precision strikes on dugouts, troop hideouts, trenches, squads, and lone soldiers.\n\nThe videos, a few of which appear in this article, are graphic images of the human cost of war and highlight just how much these weapons, really unlike anything else on the battlefield, are changing this conflict. As drone fleets grow and more pilots become trained on the technology, they're exacting heavy casualties on enemy troops and contributing to the war's increasingly static lines.\n\nNo other weapon is doing all of the things these unusual weapons do, from flying into vehicle hatches to chasing down soldiers. There's no missile, bomb, bullet, or artillery shell that can do these things, at least not like this.\n\nNot only are there more of these drones out there, Samuel Bendett, a military robotics and unmanned systems researcher, told Insider, but drone operators are also engaging in so-called \"free hunts,\" where they search for enemy targets and destroy what they find with the same drone.\n\n\"Earlier, FPV strikes took place only after it was scouted by an ISR drone,\" he said, referring to intelligence, surveillance, and reconnaissance operations. \"Now, FPV drones take off and look for the target while in flight,\" and when they find one, \"they just strike it.\"\n\nThese drones, often cheap hobby-style racing drones that cost several hundred dollars and are equipped with plastic explosives or a rocket-propelled grenade warhead, fill a combat role somewhere between a sniper rifle, a missile, and artillery, eliminating both enemy vehicles and personnel.\n\nAnd the effect of these one-way systems is magnified by the lack of combat airpower near the front lines due to the high risk of being shot down. If a drone goes down, a pilot just sends another one out.\n\n\"It is that technology that enables a very precise hit exactly where you want it,\" Bendett said.\n\n\"You can literally pilot it to any spot on a tank or an armored vehicle. You can maneuver it so that it strikes that very one small undefended area,\" he said. \"That is why we're seeing videos of these literally flying into hatches, doors, dugouts.\"\n\nThe videos of drone strikes that show up on open-source intelligence channels on an almost daily basis are likely only a fraction of the drone operations being conducted, as many probably fail for any number of reasons, from being jammed to simply running out of battery.\n\nBut the effectiveness of the attacks, many of which have taken out tanks worth millions of dollars, has both Ukraine and Russia hunting one another's drone operators, often with exploding drones.\n\nThe proliferation of exploding FPV drones, remotely operated systems able to deliver a heavy blow with an unparalleled precision, as well as other unmanned systems, is reshaping fighting in Ukraine.\n\nWhile artillery and the expenditure of substantial amounts of ammunition are still defining elements of this conflict, a Ukrainian service member said in September his unit hadn't really fired its rifles in half a year and was often relying on drones.\n\nThe Ukrainian soldier said in a video posted online that \"this is the future of warfare: shooting drones at each other rather than bullets or shells.\" Other troops have made similar comments, talking about abandoning more traditional weapons in favor of these deadly drones.\n\nBendett told Insider that this kind of fighting has the potential to lead to \"sort of a stationary kind of impasse because each side can have its movements observed, tracked, and eventually hit.\"\n\n\"Any large scale movement becomes very dangerous,\" he said, adding that \"ultimately, both sides acknowledge that anything that moves, anyone that moves can be observed, tracked, and potentially slammed with an FPV drone.\" From the videos, it's clear this is the state of the war today."],
        "_version_":1785595766080798720},
      {
        "date":["2023-11-20T00:00:00Z"],
        "title":["Ron DeSantis says Donald Trump is too old to be president: 'Father Time is undefeated'"],
        "source_url":["businessinsider.com"],
        "source_name":["Business Insider"],
        "url":["https://www.businessinsider.com/ron-desantis-donald-trump-too-old-to-be-president-2023-11"],
        "body":["Gov. Ron DeSantis of Florida told CNN on Sunday that his mentor-turned-rival Donald Trump is too old to be president.\n\n\"The presidency is not a job for somebody that's pushing 80 years old,\" DeSantis said of Trump, who celebrated his 77th birthday in June.\n\n\"I just think that that's something that has been shown with Joe Biden,\" DeSantis continued, referencing President Joe Biden, who turns 81 on Monday. \"Father Time is undefeated. Donald Trump is not exempt from any of that.\"\n\nDeSantis went on to say that his own age would make him a better GOP presidential candidate.\n\n\"I'm in the prime of my life. I go in day one, I'll serve two terms, deliver big results, and get the country moving again,\" DeSantis told CNN's Jake Tapper. \"That's what Republican voters want to see.\"\n\nDeSantis has usually shied away from attacking his former mentor directly even though both are vying for the GOP presidential nomination.\n\nTrump continues to be seen as the frontrunner for the 2024 Republican presidential primary. He has led DeSantis by nearly 50% in several recent polls for Republican candidates.\n\nA representative for the Trump campaign told Business Insider that the former president was trouncing DeSantis in the polls, and slammed DeSantis for making the comments against Trump.\n\nRepresentatives for DeSantis did not immediately respond to a request for comment from BI sent outside regular business hours."],
        "image_url":["https://i.insider.com/655abb3a4ca513d8242c0008?width=1200&format=jpeg"],
        "id":"4a481dea-2795-4b42-8029-6b05470c2ca8",
        "_version_":1785595751005421568},
      {
        "date":["2023-11-17T00:00:00Z"],
        "title":["Globalist Magazine: Donald Trump Is the 'Biggest Danger to the World'"],
        "source_url":["breitbart.com"],
        "source_name":["Breitbart"],
        "url":["https://www.breitbart.com/politics/2023/11/17/globalist-magazine-donald-trump-is-the-biggest-danger-to-the-world/"],
        "body":["Former President Donald Trump \"poses the biggest danger to the world in 2024,\" says the Economist, a leading globalist magazine.\n\n\"A shadow looms over the world,\" declares the November 16 article, adding that \"the prospect of a second Trump term fills the world's parliaments and boardrooms with despair. But despair is not a plan. It is past time to impose order on anxiety.\"\n\nThe article does not suggest any plan to \"impose order\" on American democracy.\n\nIn prior decades, establishment groups often offered concessions -- mostly insincere -- to millions of ordinary U.S. voters.\n\nToday's voters oppose establishment wealth-shifting policies on migration, wages, trade, and war-making, and the voters might be persuaded to switch their votes in exchange for once-routine campaign promises. However, the article does not even mention the primary issue that is powering Trump -- the globalist establishment's destructive determination to extract human wealth from poor countries via migration into the United States, Europe, and other developed countries.\n\nEXCLUSIVE: 2,000 Migrants Cross into Texas Border by Early Afternoon, At Least 1,500 More Expected\n\nThe magazine also does not try to explain why a former real-estate investor and TV host has become a bigger danger to the world than disease, mass migration, or the elite refusal to look for a diplomatic fix for the war with nuclear-armed Russia.\n\nInstead, the magazine's handwringing writers hide their refusal to make normal concessions by pretending that Trump's campaign pitches are steely eyed, apocalyptic convictions, saying:\n\nThe greatest threat Mr. Trump poses is to his own country. Having won back power because of his election-denial in 2020, he would surely be affirmed in his gut feeling that only losers allow themselves to be bound by the norms, customs and self-sacrifice that make a nation. In pursuing his enemies, Mr. Trump will wage war on any institution that stands in his way, including the courts and the Department of Justice.\n\n...\n\nA second Trump term would be a watershed in a way the first was not. Victory would confirm his most destructive instincts about power. His plans would encounter less resistance. And because America will have voted him in while knowing the worst, its moral authority would decline.\n\nThe article ends with an inadvertent admission that ordinary citizens have the ballot-box power to curb their elite power. \"The election will be decided by tens of thousands of voters in just a handful of states. In 2024, the fate of the world will depend on their ballots.\"\n\nBreitbart News has extensively covered the magazine's defense -- and occasional criticism -- of globalism, diversity, and migration."],
        "image_url":["https://media.breitbart.com/media/2023/11/donald-trump-baby.jpeg"],
        "id":"0c16fdf7-0256-48e1-b748-38dbd3014a17",
        "_version_":1785595758044512256},
      {
        "date":["2023-12-05T00:00:00Z"],
        "title":["Wetmore sues ex-ally who alleged 'pay-to-play' scheme with Trump"],
        "source_url":["news.yahoo.com"],
        "source_name":["Yahoo News"],
        "url":["https://news.yahoo.com/wetmore-sues-ex-ally-alleged-153442809.html"],
        "image_url":["https://media.zenfs.com/en/the-holland-sentinel/e20a2411730d7ac762c87287bde048c4"],
        "id":"6c517956-b24d-40d9-9777-3b29a84754e9",
        "body":["OTTAWA COUNTY -- Ottawa County's new deputy administrator, who has a long history of conservative political activism, is suing a former ally for defamation.\n\nBenjamin Wetmore, 42, was tapped for the county role in mid-November, according to a spokesperson.\n\nWetmore is an attorney licensed to practice criminal, real estate and nonprofit law in Texas. He moved to Michigan around 2021 and most recently worked as a legislative aide for Rep. Matt Maddock, one of several lawmakers active in Michigan's \"Grand New Party,\" a far-right offshoot of the Republican Party.\n\nMore: Insider: Michigan Republican consultant sues competitor for libel, demands apology\n\nMore: Ottawa County taps conservative political pundit Benjamin Wetmore for deputy role\n\nWetmore filed a libel suit on Nov. 28 against Adam Brassfield, a Missouri resident who partnered with him to advise GOP candidates in Michigan during the 2022 election, the Detroit News reported Sunday. The case was filed in U.S. District Court for the Eastern District of Missouri.\n\nIn the filing, Wetmore said he owns Victory Strategies LLC, a political consulting firm that manages campaigns. He claims in the filing that Brassfield published a letter on social media alleging Wetmore was involved in operating a \"pay to play\" scheme in which former President Donald Trump would issue an endorsement in exchange for a $30,000 kickback to Meshawn Maddock and possibly to the Michigan Republican Party.\n\n\"As a direct result of (the) defendant's defamatory statements, clients have terminated their relationship with plaintiffs or backed out of planned business relationships with plaintiffs, causing direct pecuniary losses to plaintiffs,\" Wetmore wrote in his lawsuit. \"These statements were objectively and provably false, and defamatory.\"\n\nHe is seeking $75,000 for \"reputational damages, business losses and branding damages\" as well as attorney fees. Wetmore is also asking the courts to force Brassfield to issue \"a press release to every newspaper in the states of Michigan, Texas, Missouri, South Dakota, and Washington, D.C.,\" with a retraction of his claims and an apology.\n\nIn the filing, Wetmore said he advises Meshawn Maddock regularly. Prior to this, he said, he worked across the country as a political consultant in various capacities for issue and candidate campaigns.\n\nMeshawn Maddock, wife of Matt Maddock, is the former MIGOP co-chair and is currently one of 16 people charged for allegedly acting as a false elector in the 2020 presidential election.\n\nAmong those Brassfield worked with was Audra Johnson of Battle Creek, a Republican running for Michigan's Third District in the U.S. House. Johnson and Brassfield sought Trump's endorsement, but the former president eventually decided to backJohn Gibbs, who lost to Democrat Hillary Scholten in November 2022.\n\nMeshawn Maddock told Johnson in October 2021 that Trump would consider endorsing Johnson if she dropped out of the congressional race and ran for a different seat, according to Wetmore's lawsuit. A month later, Brassfield began an alleged defamation campaign against Wetmore, the Detroit News reported.\n\nAfter the loss, Gibbs was hired as Ottawa County's administrator after a controversial inaugural meeting by the new Ottawa Impact majority. Ottawa Impact is a far-right fundamentalist group formed in response to school mask mandates during the COVID-19 pandemic. OI currently controls a six-seat majority on the 11-member board.\n\nSubscribe: Receive unlimited digital access to your local news coverage\n\nIn July, Gibbs hired former Victory Strategies employee Jordan Epperson as his executive aide, which prompted an age discrimination lawsuit from a candidate who met more of the position's prerequisites.\n\nIn November, the county announced Gibbs hired Wetmore as deputy administrator, replacing Patrick Waterman, who resigned July after citing a strained working relationship with Gibbs and a \"lack of effective leadership\" on the board of commissioners.\n\n-- Sarah Leach is executive editor for The Holland Sentinel. Contact her at sarah.leach@hollandsentinel.com. Follow her on Twitter @SentinelLeach.\n\nThis article originally appeared on The Holland Sentinel: Wetmore sues ex-ally who alleged 'pay-to-play' scheme with Trump"],
        "_version_":1785595761712431105}]
  },
  "interestingTerms":[
    "body:candidates",1.0,
    "body:june",1.0015032,
    "body:poll",1.0174651,
    "body:scheduled",1.0511969,
    "body:trump's",1.0938818,
    "body:regarding",1.1052889,
    "body:offered",1.135554,
    "body:criticism",1.1496264,
    "body:criticized",1.2479423,
    "body:mid",1.2677451,
    "body:season",1.3197446,
    "body:ends",1.331015,
    "body:convention",1.3630219,
    "body:unlike",1.3695675,
    "body:77",1.4058211,
    "body:died",1.456748,
    "body:gop",1.5787371,
    "body:primaries",1.6283706,
    "body:percent",1.6832563,
    "body:dies",1.7013507,
    "body:postpone",1.9394764,
    "body:outlet",2.659161,
    "body:primary",3.6506898,
    "body:insider",5.907133,
    "body:article",6.3747416]}
