{
  "responseHeader":{
    "status":0,
    "QTime":3
  },
  "match":{
    "numFound":1,
    "start":0,
    "numFoundExact":true,
    "docs":[{
      "date":["2023-11-26T00:00:00Z"],
      "title":["Media Outlet Criticized for Trying to Normalize 'the Death of Trump'"],
      "source_url":["theepochtimes.com"],
      "source_name":["www.theepochtimes.com"],
      "url":["https://www.theepochtimes.com/us/media-outlet-criticized-for-trying-to-normalize-the-death-of-trump-5536065"],
      "body":["A mainstream media outlet was criticized over its decision to publish the article.\n\nMedia outlet Business Insider was criticized over the weekend after publishing an article that offered speculation regarding what would happen \"if Donald Trump dies while running in the 2024 election.\"\n\nIn an article published Saturday, the outlet, also known as Insider, listed several different scenarios that would occur if the former president passed away before the GOP primary, during the primary, or between the primary and the general election. Former President Trump, 77, is by far the leading GOP presidential candidate, besting the No. 2 and No. 3 candidates by more than 45 percentage points, respectively.\n\n\"If Trump died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries,\" the article said, in part. \"If Trump died after the last primary contest but before the Republican National Convention, the other GOP presidential candidates would have to make a case to every state delegation at the convention for why they should be the party's nominee,\" it also said.\n\nInsider also recently ran an article with the title, \"What happens if a sitting president dies while running for reelection,\" including a photo of President Joe Biden. However, unlike the Trump article, Insider did not specifically make reference to President Biden in the headline. And unlike the Trump article, Insider used President Biden's last name sparingly throughout the article, although it did mention that President Biden turned 81 several days ago.\n\n\"If the president died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries,\" the article stated.\n\nAfter Insider published the speculative article regarding President Trump's death during the primary, some conservative commentators offered criticism. Some also claimed it's part of an attempt to normalize President Trump's death, suggesting a nefarious plot could be carried out.\n\nIn 2017, Rep. Scalise (R-La.) was shot during a practice session for the Congressional Baseball Game in Virginia. A 66-year-old self-described Bernie Sanders supporter, James Hodgkinson, was identified as the shooting suspect before he was killed by officers in a shootout.\n\nThe Epoch Times has contacted Insider for comment Sunday. The outlet has not publicly responded to the criticism of the Trump article on social media or elsewhere. President Trump also has not made any comments about it.\n\nA Monmouth University poll published last month found 76 percent of voters believe the president is too old, compared to 48 percent who said the same thing about President Trump.\n\nIn another poll from The Associated Press-NORC published in August, some 77 percent said President Biden is too old to serve another four years in office. In contrast, around half of American adults said the same about President Trump."],
      "image_url":["https://img.theepochtimes.com/assets/uploads/2023/11/06/id5523910-GettyImages-1771855590-1080x720.jpg"],
      "id":"878cf1fb-b1c7-4715-986e-e5b519fa2f35",
      "_version_":1785481868055937025
    }]
  },
  "response":{
    "numFound":9509,
    "start":0,
    "numFoundExact":true,
    "docs":[{
      "date":["2023-11-24T00:00:00Z"],
      "title":["What happens if a sitting president dies while running for reelection"],
      "source_url":["businessinsider.com"],
      "source_name":["Business Insider"],
      "url":["https://www.businessinsider.com/what-happens-if-president-dies-while-running-reelection"],
      "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nUS President Joe Biden turned 81 years old on Monday.\n\nIt's a milestone for Biden, but his age has been a thorny issue for the president, with recent polling showing voters are concerned about his age ahead of a tough reelection campaign next year.\n\nAnd it raises another obvious question: what happens if a sitting president dies while running for reelection?\n\nWell, in the immediate aftermath, we would get President Kamala Harris -- who would be the first female president and just its second Black president.\n\nThe US has a clear presidential order of succession outlined in the Constitution and the Presidential Succession Act of 1947, saying that if the president dies, the vice president takes over.\n\nFrom an electoral standpoint, Harris would also replace Biden as a Democratic presidential candidate. But his death would almost certainly open the door for other Democrats to jump into the 2024 race.\n\nThere's no national deadline to file to run for president of the United States. Instead, filing deadlines vary depending on the state and party.\n\nMany states' deadlines have already passed, however, meaning that state election officials would need to adjust them to allow new candidates to enter the race.\n\nIf the president died during primary season -- which ends in mid-June -- some states may postpone their scheduled primaries.\n\nThere's some precedent for this; at the height of the COVID-19 pandemic, more than a dozen states postponed their primaries or expanded vote-by-mail options.\n\nAnd if a sitting president died after the primaries but before their party's convention, the other presidential candidates would have to make a case to every state delegation at the convention for why they should be the party's nominee.\n\nFinally, if a president died after securing their party's nomination but before Election Day, both the Democratic and Republican parties have guidelines in place for selecting an alternate."],
      "image_url":["https://i.insider.com/655cd8744ca513d8242cd87e?width=1200&format=jpeg"],
      "id":"d237a283-a6ed-4447-b6df-5b612ca6d889",
      "_version_":1785481868954566656
    },{
      "date":["2023-11-27T00:00:00Z"],
      "title":["Russia put a Meta employee on a wanted list after designating the company a 'terrorist and extremist' organization"],
      "source_url":["businessinsider.com"],
      "source_name":["Business Insider"],
      "url":["https://www.businessinsider.com/russia-facebook-instagram-meta-employee-spokesperson-wanted-ukraine-2023-11"],
      "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nA Meta spokesperson has been wanted by Russia's Ministry of Internal Affairs database since February, media outlets based in Russia found on Sunday.\n\nAccording to Mediazona, a Russian outlet not affiliated with the state, Andy Stone is wanted by the ministry for unspecified terrorism charges. Russian state news agency TASS also reported that Stone is \"wanted under an article of the Russian Criminal Code.\"\n\nStone serves as the communications director for Meta and has been working at the social media company since 2014, per LinkedIn.\n\nThe outlet also reported that Stone was arrested in absentia by a Russian court in mid-November. Details of his case have not been released, per the outlet. The wanted database also does not give any details about his case.\n\nThe charges against Stone are another layer in Russia's crackdown on the social media giant. Before the war in Ukraine, Meta products like Facebook and Instagram enjoyed popularity among Russian users. However, the sites are now banned in Russia, and Meta itself has been listed as a \"terrorist\" and \"extremist\" organization since October 2022.\n\nWhatsApp, also owned by Meta, is still operating in the country, Mediazona reported.\n\nRussia also opened a case against Meta in March 2022, saying that the company promoted \"terrorist activity\" after it altered its hate speech rules for Ukrainian and Polish users.\n\nMediazona reported that, at the time, the Russian ministry mentioned Stone in a press release because he had announced Meta's decision to allow users to post about the \"death of Russian invaders.\"\n\nAt the time, Stone announced that the calls would be treated as political speech rather than actual threats.\n\nMeta did not immediately respond to a request for comment from Business Insider."],
      "image_url":["https://i.insider.com/6563e5d0fd6200867dcf5f8f?width=1200&format=jpeg"],
      "id":"759719fd-393b-45ef-82b3-240951c4f718",
      "_version_":1785481875322568706
    },{
      "date":["2023-12-01T00:00:00Z"],
      "title":["'Pretty horrific mistakes:' Democrats have few nice things to say about Henry Kissinger following his death"],
      "source_url":["news.yahoo.com"],
      "source_name":["Yahoo News"],
      "url":["https://news.yahoo.com/pretty-horrific-mistakes-democrats-few-232623172.html"],
      "image_url":["https://s.yimg.com/ny/api/res/1.2/LbcyTOE6u9F7a6y8JT5JsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/business_insider_articles_888/c94a2a8fd70b1002072a8586147c893e"],
      "id":"9bf603cd-4792-4faa-809d-d66d20c4627f",
      "body":["\"Let him rest in peace. I've had my statements,\" Sanders told Business Insider.\n\nTypically, when a former leading statesman dies, members of Congress only offer glowing tributes.\n\nNot in the case of Henry Kissinger.\n\n\"There's not much about Kissinger that I've heard that I think is particularly good,\" Democratic Rep. Greg Casar of Texas told Business Insider on Thursday.\n\nThe former Secretary of State's death at the age of 100 has spurred yet another round of reflections on Kissinger's legacy, which is largely intertwined with the height of America's Cold War foreign policy.\n\nKissinger, who served as both the National Security Advisor and Secretary of State under Republican Presidents Richard Nixon and Gerald Ford, has been lauded for his effectiveness in opening up relations between the US and China and pursuing a policy of detente with the Soviet Union.\n\nBut he also had a hand in foreign policy decisions that hurt and killed millions of people, including supporting repressive right-wing regimes in Latin America and planning indiscriminate bombing campaigns in Southeast Asia. Some have even argued that Kissinger should have been prosecuted for perpetrating war crimes.\n\n\"I think it's an incredibly complicated legacy,\" said Sen. Chris Murphy of Connecticut, summing up what may be the mainstream Democratic viewpoint. \"There are some pretty horrific mistakes that Henry Kissinger made that have taken the United States a very long time to recover from.\"\n\nMurphy added that Kissinger \"cared deeply about the nation's security,\" had \"significant foreign policy victories,\" and is \"a big man with a big legacy.\"\n\nCasar, who traveled to Brazil, Chile and Colombia with other progressives lawmakers in August, said they've been \"working really hard to undo\" the harms of Kissinger's policies in Latin America, which included supporting a coup by General Augusto Pinochet in 1973.\n\n\"If you ask people in Chile, there are still lots of people who are looking for the bodies of their family members that were taken and disappeared by the Pinochet regime that the United States supported,\" said Casar.\n\nOther Democrats have issued similar critiques of Kissinger's legacy in the wake of his death.\n\n\"I never understood why people revered him,\" Rep. Jim McGovern of Massachusetts wrote on X. \"I will never forgive or forget.\"\n\nRep. Gerry Connolly of Virginia, a senior Democrat on the House Foreign Affairs committee, wrote on X that Kissinger's \"indifference to human suffering will forever tarnish his name and shape his legacy.\"\n\nKissinger has also become an issue in recent Democratic presidential campaigns.\n\nIn 2016, Sen. Bernie Sanders of Vermont famously criticized Hillary Clinton for seeking foreign policy advice from the controversial former secretary of state.\n\n\"I happen to believe that Henry Kissinger was one of the most destructive secretaries of state in the modern history of this country,\" Sanders said at a February 2016 debate. \"I am proud to say that Henry Kissinger is not my friend. I will not take advice from Henry Kissinger.\"\n\nAt the time, Sanders specifically cited Kissinger's masterminding of a carpet bombing campaign in Cambodia during the Vietnam War, which paved the way for the rise of the Khmer Rouge and the mass killing of more than 3 million people.\n\n\"Count me in as somebody who will not be listening to Henry Kissinger,\" Sanders added at that debate.\n\nSanders later re-upped that criticism during his 2020 presidential campaign, when he criticized then-Secretary of State Mike Pompeo for meeting with Kissinger.\n\nOn Thursday, Sanders told Business Insider that he had no reflections to offer on Kissinger's death.\n\n\"Nope. I don't,\" said Sanders. \"He died. Let him rest in peace. I've had my statements.\"\n\nDespite criticism from Democrats, plenty of Republicans have offered warm tributes to Kissinger, including former President George W. Bush and Senate Minority Leader Mitch McConnell.\n\n\"Today, the world Henry Kissinger leaves behind bears his indelible mark,\" McConnell said on the Senate floor on Thursday. \"The nation he served -- the global superpower he helped create -- owes him our gratitude.\""],
      "_version_":1785481867897602048
    },{
      "date":["2023-11-22T00:00:00Z"],
      "title":["Senate Candidate in Michigan Says He Was Offered $20 Million to Challenge Tlaib"],
      "source_url":["nytimes.com"],
      "source_name":["The New York Times"],
      "url":["https://www.nytimes.com/2023/11/22/us/politics/hill-harper-rashida-tlaib.html"],
      "body":["Rashida Tlaib, a member of the progressive \"squad\" in the House, has been one of the most outspoken supporters of the Palestinian cause, particularly after Israel's invasion of Gaza.\n\nA Democratic Senate candidate in Michigan said he was offered $20 million by a Michigan businessman to drop out of the race and instead take on a primary challenge against Rashida Tlaib, the Palestinian American representative who was censured this month for her statements about the Israel-Gaza war.\n\nLinden Nelson, a Michigan businessman and past donor to Democratic and some Republican candidates, made the campaign funding offer to the Senate candidate, Hill Harper, last month, according to Karthik Ganapathy, a spokesman for Mr. Harper's campaign. Mr. Nelson also donated $13,000 to Concerned Citizens of Michigan, a group that supported a primary challenge against Ms. Tlaib in 2020.\n\nMr. Ganapathy added that the conversation between Mr. Hill and Mr. Nelson was \"respectful on both sides.\" Calls to Mr. Nelson's phone number on Wednesday were not answered. Ms. Tlaib declined to comment on the record.\n\n\"I'm not going to run against the only Palestinian-American in Congress just because some special interests don't like her,\" Mr. Harper said in a statement on X, formerly known as Twitter. He also criticized \"the Israel lobby\" and \"a broken political and campaign finance system that's tilted towards the wealthy and powerful.\"\n\nThe funding offer would have in effect eliminated a progressive candidate from the crowded Democratic primary for an open Senate seat in Michigan and pitted him against Ms. Tlaib, a member of the progressive \"squad\" in the House. She has drawn criticism after breaking with Democrats who support Israel's invasion of Gaza following a deadly terrorist attack carried out by Hamas.\n\nThe offer also reflects a growing effort to target Democratic candidates who have either been critical of Israel or sympathetic to Palestinian causes. A Democratic pro-Israel group began running television ads this month that criticize Ms. Tlaib for her positions on the war in Gaza -- such as calling for an immediate cease-fire in the conflict. Other primary challenges are brewing against progressive representatives like Summer Lee of Pennsylvania and Jamaal Bowman of New York.\n\nMr. Harper, an author and actor known for his roles on \"CSI: NY\" and \"The Good Doctor,\" said on X that he was approached by \"one of AIPAC's biggest donors,\" referring to the American Israel Public Affairs Committee, soon after Politico published an article first reporting Mr. Nelson's offer. He said he declined the offer, adding, \"I won't be bossed, bullied, or bought.\"\n\nAIPAC, among other pro-Israel groups, spent tens of millions of dollars supporting candidates in Democratic primaries in the 2022 midterms. Progressive organizations are concerned that these groups will sway primaries against progressive Democratic elected officials next year.\n\nUsamah Andrabi, the communications director for Justice Democrats, a progressive group that helped elect many of the targeted House members, criticized Mr. Nelson's reported offer, saying \"if that's not showing that our democracy and our elections are for sale to the highest millionaire donor, then I'm not sure what is.\"\n\nAlain Delaquérière contributed research."],
      "image_url":["https://static01.nyt.com/images/2023/11/22/us/politics/22pol-tlaib-primary1/22pol-tlaib-primary1-videoSixteenByNine3000.jpg"],
      "id":"703358fc-afa6-4b17-9436-ae82566d4711",
      "_version_":1785481868182814720
    },{
      "date":["2023-12-01T00:00:00Z"],
      "title":["Why on Earth did Ron DeSantis think it was a good idea to debate Gavin Newsom?"],
      "source_url":["businessinsider.com"],
      "source_name":["Business Insider"],
      "url":["https://www.businessinsider.com/why-on-earth-did-ron-desantis-debate-gavin-newsom-2023-12"],
      "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nThere's nothing people love more than watching a likely catastrophe live.\n\nCase in point: around 40,000 Texans lined up to watch two trains crash into each other in 1896 for a marketing ploy by the Missouri-Kansas-Texas Railroad that ended in death and disaster.\n\nSimilarly, on Thursday night, millions tuned into or watched highlights of an unnecessary debate between Republican presidential candidate and Florida Gov. Ron DeSantis and California Gov. Gavin Newsom.\n\nNo humans died on Thursday -- unlike the \"Crash at Crush\" -- but the night was still a trainwreck for DeSantis' presidential campaign from the very beginning.\n\n\"There's one thing, in closing, that we have in common,\" Newsom noted in his opening statement, \"is neither of us will be the nominee for our party in 2024.\"\n\nRealistically, DeSantis had the upper hand from the start: the debate was held in Georgia (much closer to his home state than California), hosted by conservative news outlet Fox News, and moderated by one of its most tenured right-wing presenters, Sean Hannity.\n\nDebates, truthfully, can be tricky to pick a \"winner\" for. Following the first GOP presidential debate this year, Business Insider and several other outlets called Vivek Ramaswamy a breakout star after commanding attention away from his competitors.\n\nBut after the dust had settled, polling showed that Ramaswamy's performance -- despite being attention-grabbing and Trump-like -- may have actually hurt how potential voters viewed him.\n\nUnlike the Republican presidential debates, there likely weren't any pre-and-post-debate polls from the Newsom-DeSantis clash. And while each base will surely view the debates from differing perspectives, it's hard to imagine many potential voters were won over by DeSantis explicitly saying it's \"not true\" that he's followed \"science\" and \"facts\" during his time in office.\n\nAll Newsom seemed to do at the debate was highlight DeSantis' actions and policies during his time in congressional and state leadership, but it was more than enough to send the Florida governor into a series of grimaces and uncomfortably forced smiles.\n\nSo why on Earth would DeSantis agree to a debate like this in the first place?\n\nThe likeliest reason is that despite being in second place in the GOP presidential primary polling, DeSantis is nearly 50 percentage points behind former President Donald Trump.\n\nBarring Trump going to prison before the 2024 election, which could happen given the 91 felony charges levied against him in jurisdictions across the country, it's pretty much an insurmountable hurdle to overcome.\n\nWith this in mind, DeSantis and his campaign likely saw the debate similar to how an NFL team views a \"hail mary\" pass at the end of a close game: highly improbable it'll work out for the best, but if it does, everyone involved comes out as a hero.\n\nUnfortunately for DeSantis, the legacy of Thursday night's debate likely won't be about how the Florida governor turned his flopping campaign around against all odds.\n\nInstead, cringeworthy images, GIFs, and videos from the evening may come back to haunt him for the rest of this presidential campaign and possibly even in 2028 if he decides to run again too, especially if Newsom runs as well."],
      "image_url":["https://i.insider.com/6569faa758e7c0c29a28b057?width=1200&format=jpeg"],
      "id":"c5d02bc3-09cc-46d7-9f31-df789ddb81f4",
      "_version_":1785481869977976834
    },{
      "date":["2023-11-17T00:00:00Z"],
      "title":["Exploding drones are proving a weapon unlike any other in Ukraine, and no one is safe, combat videos show"],
      "source_url":["businessinsider.com"],
      "source_name":["Business Insider"],
      "url":["https://www.businessinsider.com/videos-nothing-is-safe-from-exploding-drones-in-ukraine-2023-11"],
      "image_url":["https://i.insider.com/6556516136d588dc55d1a7b4?width=1200&format=jpeg"],
      "id":"d221cb8d-09b1-43d5-bdc5-61e39f23af5a",
      "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nMore and more, it isn't just tanks and armored vehicles falling prey to cheap hobby drones packed with explosives in Ukraine. These weapons are seemingly everywhere, killing not just unlucky vehicle crews but also dismounted infantry, sometimes even just a single soldier. Anything that moves is at risk.\n\n\"Welcome to the future. It sucks,\" a drone expert told Insider as combat footage from Ukraine on social media increasingly shows that nothing and no one is safe from these weapons.\n\nWhile videos from the war still regularly show first-person-view (FPV) drones slamming into tanks, armored personnel carriers, and supply trucks, footage also frequently shows precision strikes on dugouts, troop hideouts, trenches, squads, and lone soldiers.\n\nThe videos, a few of which appear in this article, are graphic images of the human cost of war and highlight just how much these weapons, really unlike anything else on the battlefield, are changing this conflict. As drone fleets grow and more pilots become trained on the technology, they're exacting heavy casualties on enemy troops and contributing to the war's increasingly static lines.\n\nNo other weapon is doing all of the things these unusual weapons do, from flying into vehicle hatches to chasing down soldiers. There's no missile, bomb, bullet, or artillery shell that can do these things, at least not like this.\n\nNot only are there more of these drones out there, Samuel Bendett, a military robotics and unmanned systems researcher, told Insider, but drone operators are also engaging in so-called \"free hunts,\" where they search for enemy targets and destroy what they find with the same drone.\n\n\"Earlier, FPV strikes took place only after it was scouted by an ISR drone,\" he said, referring to intelligence, surveillance, and reconnaissance operations. \"Now, FPV drones take off and look for the target while in flight,\" and when they find one, \"they just strike it.\"\n\nThese drones, often cheap hobby-style racing drones that cost several hundred dollars and are equipped with plastic explosives or a rocket-propelled grenade warhead, fill a combat role somewhere between a sniper rifle, a missile, and artillery, eliminating both enemy vehicles and personnel.\n\nAnd the effect of these one-way systems is magnified by the lack of combat airpower near the front lines due to the high risk of being shot down. If a drone goes down, a pilot just sends another one out.\n\n\"It is that technology that enables a very precise hit exactly where you want it,\" Bendett said.\n\n\"You can literally pilot it to any spot on a tank or an armored vehicle. You can maneuver it so that it strikes that very one small undefended area,\" he said. \"That is why we're seeing videos of these literally flying into hatches, doors, dugouts.\"\n\nThe videos of drone strikes that show up on open-source intelligence channels on an almost daily basis are likely only a fraction of the drone operations being conducted, as many probably fail for any number of reasons, from being jammed to simply running out of battery.\n\nBut the effectiveness of the attacks, many of which have taken out tanks worth millions of dollars, has both Ukraine and Russia hunting one another's drone operators, often with exploding drones.\n\nThe proliferation of exploding FPV drones, remotely operated systems able to deliver a heavy blow with an unparalleled precision, as well as other unmanned systems, is reshaping fighting in Ukraine.\n\nWhile artillery and the expenditure of substantial amounts of ammunition are still defining elements of this conflict, a Ukrainian service member said in September his unit hadn't really fired its rifles in half a year and was often relying on drones.\n\nThe Ukrainian soldier said in a video posted online that \"this is the future of warfare: shooting drones at each other rather than bullets or shells.\" Other troops have made similar comments, talking about abandoning more traditional weapons in favor of these deadly drones.\n\nBendett told Insider that this kind of fighting has the potential to lead to \"sort of a stationary kind of impasse because each side can have its movements observed, tracked, and eventually hit.\"\n\n\"Any large scale movement becomes very dangerous,\" he said, adding that \"ultimately, both sides acknowledge that anything that moves, anyone that moves can be observed, tracked, and potentially slammed with an FPV drone.\" From the videos, it's clear this is the state of the war today."],
      "_version_":1785481875168428035
    },{
      "date":["2023-11-20T00:00:00Z"],
      "title":["Ron DeSantis says Donald Trump is too old to be president: 'Father Time is undefeated'"],
      "source_url":["businessinsider.com"],
      "source_name":["Business Insider"],
      "url":["https://www.businessinsider.com/ron-desantis-donald-trump-too-old-to-be-president-2023-11"],
      "body":["Gov. Ron DeSantis of Florida told CNN on Sunday that his mentor-turned-rival Donald Trump is too old to be president.\n\n\"The presidency is not a job for somebody that's pushing 80 years old,\" DeSantis said of Trump, who celebrated his 77th birthday in June.\n\n\"I just think that that's something that has been shown with Joe Biden,\" DeSantis continued, referencing President Joe Biden, who turns 81 on Monday. \"Father Time is undefeated. Donald Trump is not exempt from any of that.\"\n\nDeSantis went on to say that his own age would make him a better GOP presidential candidate.\n\n\"I'm in the prime of my life. I go in day one, I'll serve two terms, deliver big results, and get the country moving again,\" DeSantis told CNN's Jake Tapper. \"That's what Republican voters want to see.\"\n\nDeSantis has usually shied away from attacking his former mentor directly even though both are vying for the GOP presidential nomination.\n\nTrump continues to be seen as the frontrunner for the 2024 Republican presidential primary. He has led DeSantis by nearly 50% in several recent polls for Republican candidates.\n\nA representative for the Trump campaign told Business Insider that the former president was trouncing DeSantis in the polls, and slammed DeSantis for making the comments against Trump.\n\nRepresentatives for DeSantis did not immediately respond to a request for comment from BI sent outside regular business hours."],
      "image_url":["https://i.insider.com/655abb3a4ca513d8242c0008?width=1200&format=jpeg"],
      "id":"30960228-59eb-4ebf-9e65-75534e3e30cc",
      "_version_":1785481870232780801
    },{
      "date":["2023-11-17T00:00:00Z"],
      "title":["Globalist Magazine: Donald Trump Is the 'Biggest Danger to the World'"],
      "source_url":["breitbart.com"],
      "source_name":["Breitbart"],
      "url":["https://www.breitbart.com/politics/2023/11/17/globalist-magazine-donald-trump-is-the-biggest-danger-to-the-world/"],
      "body":["Former President Donald Trump \"poses the biggest danger to the world in 2024,\" says the Economist, a leading globalist magazine.\n\n\"A shadow looms over the world,\" declares the November 16 article, adding that \"the prospect of a second Trump term fills the world's parliaments and boardrooms with despair. But despair is not a plan. It is past time to impose order on anxiety.\"\n\nThe article does not suggest any plan to \"impose order\" on American democracy.\n\nIn prior decades, establishment groups often offered concessions -- mostly insincere -- to millions of ordinary U.S. voters.\n\nToday's voters oppose establishment wealth-shifting policies on migration, wages, trade, and war-making, and the voters might be persuaded to switch their votes in exchange for once-routine campaign promises. However, the article does not even mention the primary issue that is powering Trump -- the globalist establishment's destructive determination to extract human wealth from poor countries via migration into the United States, Europe, and other developed countries.\n\nEXCLUSIVE: 2,000 Migrants Cross into Texas Border by Early Afternoon, At Least 1,500 More Expected\n\nThe magazine also does not try to explain why a former real-estate investor and TV host has become a bigger danger to the world than disease, mass migration, or the elite refusal to look for a diplomatic fix for the war with nuclear-armed Russia.\n\nInstead, the magazine's handwringing writers hide their refusal to make normal concessions by pretending that Trump's campaign pitches are steely eyed, apocalyptic convictions, saying:\n\nThe greatest threat Mr. Trump poses is to his own country. Having won back power because of his election-denial in 2020, he would surely be affirmed in his gut feeling that only losers allow themselves to be bound by the norms, customs and self-sacrifice that make a nation. In pursuing his enemies, Mr. Trump will wage war on any institution that stands in his way, including the courts and the Department of Justice.\n\n...\n\nA second Trump term would be a watershed in a way the first was not. Victory would confirm his most destructive instincts about power. His plans would encounter less resistance. And because America will have voted him in while knowing the worst, its moral authority would decline.\n\nThe article ends with an inadvertent admission that ordinary citizens have the ballot-box power to curb their elite power. \"The election will be decided by tens of thousands of voters in just a handful of states. In 2024, the fate of the world will depend on their ballots.\"\n\nBreitbart News has extensively covered the magazine's defense -- and occasional criticism -- of globalism, diversity, and migration."],
      "image_url":["https://media.breitbart.com/media/2023/11/donald-trump-baby.jpeg"],
      "id":"77b026b5-42a4-48a7-b170-feba382260d7",
      "_version_":1785481872512385024
    },{
      "date":["2023-12-03T00:00:00Z"],
      "title":["A group of Mississippi cops terrorized residents for more than two decades almost entirely unchecked"],
      "source_url":["businessinsider.com"],
      "source_name":["Business Insider"],
      "url":["https://www.businessinsider.com/mississippi-goon-squad-cops-rankin-county-sheriff-department-2023-12"],
      "image_url":["https://i.insider.com/656cbe870ec98e92f74b82f9?width=1200&format=jpeg"],
      "id":"3bb52acd-22f0-4b35-9bad-5141921bd9bc",
      "body":["By clicking \"Sign Up\", you accept our Terms of Service and Privacy Policy. You can opt-out at any time.\n\nA number of deputies within the Rankin County Sheriff's Department in Mississippi got away with abusing people for years, almost entirely unchecked.\n\nFive deputies from the department, who called themselves the \"Goon Squad\" for their willingness to use excessive force, pleaded guilty to torturing and sexually assaulting Michael Jenkins and Eddie Terrell Parker, two Black men, during a raid in August 2023.\n\nBut that was only the culmination of years of violence.\n\nCourt documents and incident reports previously reviewed by Business Insider showed two of the officers involved, Christian Dedmon and Hunter Elward, were also present at the deaths of two other Black men in 2019 and 2021.\n\nBusiness Insider also successfully sued the Rankin County Sheriff's Department in 2022 for records related to the death of three people held in their custody and discovered that at least five people died in the custody of the sheriff's Department during an 8-month period in 2021.\n\nThe judge sided with Business Insider in March after Business Insider's lawyers argued that the records sought should be made public under Mississippi's public records law.\n\nThe sheriff's department argued unsuccessfully that the records were \"investigative reports,\" which are not public. The department said the records could not be turned over until the Mississippi Bureau of Investigation had finished its inquiry into the deaths.\n\n\"This ruling cements that law enforcement agencies are subject to our state's public records act -- the same as any other state agency,\" Paloma Wu, an attorney for Business Insider, said at the time.\n\nAnd now, a new report from The New York Times uncovered several other instances of abuse, often at the hands of the same group of sheriff's deputies.\n\nReporters for The New York Times and Mississippi Today reviewed hundreds of pages of sheriff's office reports and court records and interviewed dozens of people who say they saw or experienced torture at the hands of the sheriff's department's narcotics unit over the course of two decades.\n\nThe witnesses interviewed by The Times described violence and abuse by the deputies that sometimes went on for hours and appeared intended to strike terror into the victims, according to the report.\n\nAt least 12 of the 17 cases described in the report began after a suspect was set up by a confidential informant. In six cases, sources said the deputies threatened to continue hurting them until they disclosed the location of drugs.\n\nAccording to the report, Brett McAlpin, a former chief investigator for the department, was connected to at least 13 of the arrests and was described by witnesses as leading the raids. Christian Dedmon, a former narcotics detective, was also involved in eight incidents, the report says.\n\nRick Loveday, a former Hinds County sheriff's deputy, told The Times that Rankin deputies even assaulted him during a raid on his home in 2018.\n\nMcAlpin arrested Loveday after Loveday says he violently assaulted him during the raid, accused him of consorting with drug dealers, and ordered him to leave town, according to The Times.\n\n\"Brett McAlpin came in my house, accused me of things I didn't do, beat my ass, stomped my ass, sat on my chest where I couldn't protect my head and punched me in the face,\" Loveday told the outlet.\n\nWhen Loveday told McAlpin that he was taking blood thinners and the blows could cause him serious injury, he told The Times that McAlpin continued to hit him.\n\n\"Every time he punched me, he said 'I, don't, give, a, fuck,'\" Loveday said. \"He didn't care if I died.\"\n\nLoveday said he fled the state over fear that police would target him again.\n\n\"If they did that to me, how many other people have they done it to?\" Loveday told The Times.\n\nRankin County Sheriff Bryan Bailey, who was reelected in November after running unopposed, repeatedly declined to comment when reached by The Times. When told that several high-ranking deputies were involved in the arrests that sparked accusations of abuse, he replied, \"I have 240 employees, there's no way I can be with them each and every day.\"\n\nA spokesperson for the Rankin County Sheriff's Department did not return a request for comment from Business Insider.\n\nIncident reports and court documents obtained by Business Insider previously connected two of the deputies, Christian Dedmon and Hunter Elward, to the deaths of two Black men in 2019 and 2021.\n\nIn one of those reports, Elward wrote that he punched Damien Cameron at least three times and tased him three times before his death.\n\nMonica Lee, Cameron's mother, told Business Insider that deputies knelt on her son's back for more than 15 minutes even as he complained that he could not breathe. The Mississippi state medical examiner found Cameron's cause of death inconclusive, according to Lee.\n\nA Mississippi grand jury declined to press charges against Elward and other deputies involved in the beating due to insufficient evidence in October 2022.\n\nLee told Business Insider that she didn't understand the jury's decision because the evidence of the beating was \"in his face.\"\n\nI didn't get it,\" Lee said at the time.\n\n\"I don't know if they have pictures of my son or what,\" she added.\n\nWarning: Graphic content\n\nElward and Dedmon were also present during the police shooting of Pierre Woods in February 2019, according to court records.\n\nIn 2021, Vanessa Barrett and Dris Mitchell, two women who have children with Woods, filed a lawsuit against Bailey and more than a dozen other officers who were there when police shot Woods.\n\nCourt documents filed in August noted that Elward and Dedmon were defendants in the case and had since been fired from the sheriff's department due to their convictions in the torture case.\n\nA federal judge denied Bailey immunity from discovery in the lawsuit in March. Bailey appealed the decision, and a federal appeals court denied his appeal in October, court documents show.\n\nThe sheriff's department reached an undisclosed settlement agreement with Woods's loved ones in October after the judge rejected Bailey's appeal, according to appeals court records."],
      "_version_":1785481874056937474
    },{
      "date":["2023-11-29T00:00:00Z"],
      "title":["Frontline Conservatives Blame Failing Republican Campaigns on Party Leaders"],
      "source_url":["theepochtimes.com"],
      "source_name":["www.theepochtimes.com"],
      "url":["https://www.theepochtimes.com/us/frontline-conservatives-blame-failing-republican-campaigns-on-party-leaders-5538118"],
      "image_url":["https://img.theepochtimes.com/assets/uploads/2023/05/01/id5232919-ronna-mcdaniel-in-green-700x420.jpg"],
      "id":"53685846-309f-41b3-8f61-4277d2ec49a3",
      "body":["Criticism of the Republican National Committee's alleged 'country club' attitude has trickled down to the GOP's local levels.\n\nIn the wake of continued unrest over the actions of the Republican National Committee (RNC), some frontline conservatives say that GOP leaders have become too elitist to listen to ordinary voters.\n\n\"They think they know better than us,\" Freddy Burgos, a Fairfax County, Virginia Republican told The Epoch Times, \"so they ignore our wishes.\"\n\nThe home improvement contractor said that many in GOP leadership are now elitist \"country club Republicans.\"\n\n\"They have become more like dictators than representatives,\" he added. \"We basically have a Republican leadership with a Democratic mentality.\"\n\nMr. Burgos was recently part of a movement to censure local Republican Party leaders for promoting candidates for school board seats that were not \"true Republicans.\" They included one candidate who was openly a Democrat and even hosted a Democratic fundraiser just before switching parties, he said.\n\nThe move followed the defeat in November of some of Virginia Gov. Glenn Youngkin-backed Republican candidates and the Democrats' retention of the state Senate and capture of the state House.\n\nA resolution, initiated by Mr. Burgos and several other members of the Fairfax County Republican Committee, was specifically aimed at Mike Ginsberg, chairman of the 11th Congressional District of Virginia Republican Committee.\n\nMr. Ginsberg was accused of taking action that \"resulted in election losses on November 7, 2023.\"\n\nIt also accused him of leading a \"flawed endorsement process\" and \"negative media publicity\" and for failing to ensure that candidates took the pledge to affirm the Republican Party Creed.\n\nThe resolution also called for censuring Fairfax County GOP Chairman Steve Knotts, but there was a last-minute decision to omit him since he wasn't seeking re-election.\n\nMr. Knotts and Mr. Ginsberg did not respond to requests by The Epoch Times for comment about the resolution.\n\nStacy Langton, a conservative mom who became a national figure in the fight against sexually graphic books in school libraries, told The Epoch Times that she also disagrees with the party's leadership.\n\nShe says Mr. Knotts and Mr. Ginsberg overlooked more traditional conservatives qualified \"for the job\" and instead went for what she said seemed more like political operatives interested in supporting the \"anti-Trump\" movement within the party than bolstering traditional party values.\n\nShe pointed to a Republican school board candidate who received no support from the county's GOP leaders and yet received significantly more votes than the \"Democratic candidate they bolstered.\"\n\n\"What you see happening in Fairfax County on a smaller level is happening nationally,\" she said. \"You have establishment people working against America First MAGA candidates.\"\n\nMr. Burgos agrees, pointing to Republicans who seem to be doing more, he says, to defeat former President Donald Trump than to defeat President Joe Biden.\n\nMs. Langton added that \"it's insulting enough\" when establishment Democrats like Hillary Clinton say Trump supporters are so mentally unfit they need deprogramming, but \"it adds insult to injury when your own party leaders accuse you of that same mental defect.\"\n\nShe said that she herself has experienced what she described. She filed a lawsuit against one of the school board candidates that Mr. Ginbsberg and Mr. Knotts promoted. The suit alleged that the candidate created a fake porn account on Facebook in Ms. Langton's name.\n\nDespite his wealth and Ivy League background, Mr. Trump is not a \"country club Republican,\" said Mr. Burgos, noting that Democrats have relentlessly attacked him and his family and threatened his livelihood.\n\n\"Trump is more ordinary than ever,\" he said. \"He's being bullied by the elite and that's what makes him so relatable to the average Joe and so hated by the establishment.\"\n\nAs unrest over party leadership trickles down to the local level, criticism continues to trickle up to the national level.\n\nAfter Republicans in Virginia and other states suffered unexpected defeats on Nov. 7, the third GOP presidential debate was held the following night.\n\nCandidate Vivek Ramaswamy reignited a call for RNC Chairwoman Ronna McDaniel to step down and accused her of captaining a \"party of losers.\"\n\nHe followed up by posting a website, fireronna.com, asking respondents to vote yes or no on removing Ms. McDaniels. Although it didn't seem to help much with Mr. Ramaswamy's slipping poll ratings, it did appear to set off a domino effect with a hailstorm of notable party influencers calling daily for her resignation.\n\nMs. McDaniel, a graduate of Brigham Young University and the niece of Trump critic Sen. Mitt Romney (R-Utah), quickly moved to extinguish the political firestorm by appearing on major TV networks. She told CNN that \"we lost races in 2022 because of vitriol within our party.\"\n\nCriticized in the past for not doing enough to support Mr. Trump against Democratic attacks, she also publicly vowed that the RNC would \"absolutely\" support the former president \"if voters chose him\" -- even if he was convicted of a crime.\n\nIn an X post a few days before Thanksgiving, Mr. Trump berated the RNC, saying they wasted money on the GOP presidential debates and called for a revamp of its leadership.\n\n\"Use it against the Democrats to STOP The STEAL! If not, REVAMP THE RNC\" NOW!!!,\" Mr. Trump demanded.\n\nMr. Trump referenced a new poll showing that in spite of his skipping the debates, he was still leading with 67 percent of the voters while second-place candidate Flordia Gov. Ron DeSantis was mustering 9 percent, and former South Carolina Gov. Nikki Haley, a former U.N. ambassador, was at 8 percent.\n\nMore bad publicity soon hit Ms. McDaniel. Based on Federal Election Commission records, the RNC has its lowest amount in its coffers in nearly a decade -- about $9 million -- while the Democratic National Committee has almost twice that.\n\nThis week, Ms. McDaniel's intentions were brought into question by a former leader of the RNC.\n\nScott Reed, who led the national committee in the mid-1990s, told Business Insider that it seemed that the last GOP debate was scheduled deliberately on the same night as the Country Music Association Awards, a popular televised event with a largely conservative audience.\n\n\"Who in the world would schedule a debate on the same night as the country music awards unless you were actually trying not to reach Republican primary voters,\" he said."],
      "_version_":1785481870014676993
    }]
  },
  "interestingTerms":["body:candidates",1.0,"body:june",1.0157102,"body:poll",1.0463598,"body:scheduled",1.0538847,"body:trump's",1.1048433,"body:regarding",1.1148067,"body:offered",1.1389788,"body:criticism",1.1598165,"body:mid",1.2753525,"body:criticized",1.2759202,"body:season",1.3467848,"body:ends",1.3557419,"body:convention",1.3657845,"body:unlike",1.389598,"body:77",1.4242759,"body:died",1.4794914,"body:gop",1.602355,"body:primaries",1.6443496,"body:percent",1.7205824,"body:dies",1.7573984,"body:postpone",1.9587314,"body:outlet",2.6430712,"body:primary",3.6753383,"body:insider",5.8756924,"body:article",6.435443]
}